       IDENTIFICATION DIVISION.
       PROGRAM-ID. SM0002.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-PC.
       OBJECT-COMPUTER.    IBM-PC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01  DFHCOMMAREA        PIC X(21).
       PROCEDURE DIVISION.
       100-PROCESS.
           EXEC CICS IGNORE CONDITION
                     ERROR 
           END-EXEC
           MOVE 'SM0002 WAS IN CONTROL' TO DFHCOMMAREA.
       100-EXIT.
           EXIT.