       IDENTIFICATION DIVISION.
       PROGRAM-ID. SM0001.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-PC.
       OBJECT-COMPUTER.    IBM-PC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COMMAREA.
           05 WS-PROG-STATE  PIC X(21).
           05 WS-OPTION      PIC X.  
       LINKAGE SECTION.
       01  DFHCOMMAREA        PIC X(22).
       PROCEDURE DIVISION.
       100-PROCESS.
           EXEC CICS IGNORE CONDITION
                     ERROR 
           END-EXEC
           MOVE 'SM0001 WAS IN CONTROL' TO WS-PROG-STATE.
       100-EXIT.
           EXIT.